In [11]:
import numpy as np
import pandas as pd

In [5]:
first_series = pd.Series(list("abcdefgh"))
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
dtype: object

In [6]:
dic_country = pd.Series([3000000, 40000, 50000000, 600], index = ["England", "France", "Japan", "Hawaii"])
print(dic_country)

England     3000000
France        40000
Japan      50000000
Hawaii          600
dtype: int64

In [7]:
scalar_series = pd.Series(5., index = ["abcgfh", "zyxvr", "tyhdji", "fakhjlc"])
print(scalar_series)

abcgfh     5.0
zyxvr      5.0
tyhdji     5.0
fakhjlc    5.0
dtype: float64

In [8]:
print(dic_country[2])
print(scalar_series["zyxvr"])

50000000
5.0

C:\Users\kaige\AppData\Local\Temp\ipykernel_27364\3510470602.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(dic_country[2])

In [9]:
first_Vector_Series = pd.Series([1, 2, 3, 4], index = ["a", "b", "c", "d"])
second_Vector_Series = pd.Series([10, 20, 30, 40], index = ["a", "b", "c", "d"])
print(first_Vector_Series + second_Vector_Series)

a    11
b    22
c    33
d    44
dtype: int64

In [10]:
second_Vector_Series = pd.Series([10, 20, 30, 40], index = ["a", "d", "b", "c"])
print(first_Vector_Series + second_Vector_Series)

a    11
b    32
c    43
d    24
dtype: int64

In [11]:
second_Vector_Series = pd.Series([10, 20, 30, 40], index = ["a", "b", "e", "f"])
print(first_Vector_Series + second_Vector_Series)

a    11.0
b    22.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

# creating dataframes from lists

In [12]:
olympic_list = {"Host_city" : ["London", "Beijing", "Athens", "Sydney", "Atlanta"], 
               "Year" : [2012, 2008, 2004, 2000, 1996], 
               "Num_of_participating_countrys" : [205, 204, 200, 201, 207]}

df_olympic_list = pd.DataFrame(olympic_list)

In [13]:
df_olympic_list

  Host_city  Year  Num_of_participating_countrys
0    London  2012                            205
1   Beijing  2008                            204
2    Athens  2004                            200
3    Sydney  2000                            201
4   Atlanta  1996                            207

# Creating dataframe from dictionary

In [14]:
olympic_data_dict = {"London" : {2012 : 205}, "Atlanta" : {1996 : 207}}

df_olympic_data_dict = pd.DataFrame(olympic_data_dict)

df_olympic_data_dict

      London  Atlanta
2012   205.0      NaN
1996     NaN    207.0

In [15]:
df_olympic_list.Host_city

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: Host_city, dtype: object

In [16]:
#use describe function to display the content
df_olympic_list.describe

<bound method NDFrame.describe of   Host_city  Year  Num_of_participating_countrys
0    London  2012                            205
1   Beijing  2008                            204
2    Athens  2004                            200
3    Sydney  2000                            201
4   Atlanta  1996                            207>

In [17]:
olympic_series_participation = pd.Series([205, 204, 201, 200, 197], index = [2012, 2008, 2004, 2000, 1996])
olympic_series_country = pd.Series(["London", "Beijing", "Athens", "Sydney", "Atlanta"], index = [2012, 2008, 2004, 2000, 1996])

df_olympic_series = pd.DataFrame({"Num_of_participating_countrys" : olympic_series_participation, "Host_city" : olympic_series_country})
df_olympic_series

      Num_of_participating_countrys Host_city
2012                            205    London
2008                            204   Beijing
2004                            201    Athens
2000                            200    Sydney
1996                            197   Atlanta

In [18]:
#creating dataframe from dictionary ndarray
np_array = np.array([2012, 2008, 2004, 2006])
dict_ndarray = {"Year" : np_array}

df_ndarray = pd.DataFrame(dict_ndarray)
df_ndarray

   Year
0  2012
1  2008
2  2004
3  2006

In [19]:
#creating dataframe from another dataframe object
df_from_df = pd.DataFrame(df_olympic_series)
df_from_df

      Num_of_participating_countrys Host_city
2012                            205    London
2008                            204   Beijing
2004                            201    Athens
2000                            200    Sydney
1996                            197   Atlanta

# Missing Values

In [20]:
first_series = pd.Series([1, 2, 3, 4, 5], index = ["a", "b", "c", "d", "e"])
second_series = pd.Series([10, 20, 30, 40, 50], index = ["c", "e", "f", "g", "h"])

sum_of_series = first_series + second_series
sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [21]:
#dropna function drops all the NaN values from the dataset
dropna_series = sum_of_series.dropna()
dropna_series

c    13.0
e    25.0
dtype: float64

In [22]:
#filling all the missing values with zero instead of dropping them
dropna_series.fillna(0)
fillna_series = sum_of_series.fillna(0)
fillna_series

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [23]:
fill_series_sum = first_series.add(second_series, fill_value = 0)
fill_series_sum

a     1.0
b     2.0
c    13.0
d     4.0
e    25.0
f    30.0
g    40.0
h    50.0
dtype: float64

# Data Operation

In [25]:
df_movie_rating = pd.DataFrame(
    {"movie1" : [1, 2, 5, 3, 4, 1],
     "movie2" : [2, 3, 5, 1, 2, 4]},
     index = ["abc", "kia", "kai", "bob", "jeff", "car"]
    )
df_movie_rating

      movie1  movie2
abc        1       2
kia        2       3
kai        5       5
bob        3       1
jeff       4       2
car        1       4

# Applying custom functions in pandas dataframe

In [27]:
def grade(rating):
    if rating == 5:
        return "A"
    elif rating == 4:
        return "B"
    elif rating == 3:
        return "C"
    else:
        return "F"
print(grade(5))

A

In [28]:
df_movie_rating.applymap(grade)

C:\Users\kaige\AppData\Local\Temp\ipykernel_27364\3005860822.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df_movie_rating.applymap(grade)

     movie1 movie2
abc       F      F
kia       F      C
kai       A      A
bob       C      F
jeff      B      F
car       F      B

In [30]:
df_test_scores = pd.DataFrame(
    {"test1" : [40, 96, 50, 100, 30, 10],
     "test2" : [54, 79, 80, 100, 20, 40]},
     index = ["abc", "kia", "kai", "bob", "jeff", "car"]
    )
df_test_scores

      test1  test2
abc      40     54
kia      96     79
kai      50     80
bob     100    100
jeff     30     20
car      10     40

In [31]:
df_test_scores.max()

test1    100
test2    100
dtype: int64

In [32]:
df_test_scores.min()

test1    10
test2    20
dtype: int64

In [33]:
df_name = pd.DataFrame(
    {"first" : ["kai", "john", "bob", "jeff", "kai", "dave"],
     "last" : ["Gellard", "smith", "callum", "colgate", "lewis", "jones"]})
df_name

  first     last
0   kai  Gellard
1  john    smith
2   bob   callum
3  jeff  colgate
4   kai    lewis
5  dave    jones

In [36]:
group_first = df_name.groupby("first")

group_data = group_first.get_group("kai")
group_data

  first     last
0   kai  Gellard
4   kai    lewis

In [37]:
df_name.sort_values("first")

  first     last
2   bob   callum
5  dave    jones
3  jeff  colgate
1  john    smith
0   kai  Gellard
4   kai    lewis

# Pandas SQL operation

In [1]:
import sqlite3

In [2]:
create_table = """
CREATE TABLE student_score
(ID INTERGER, NAME VARCHAR (20), Math REAL, Science REAL);
"""

In [3]:
#executing SQL statement 
executeSQL = sqlite3.connect(":memory:")
executeSQL.execute(create_table)
executeSQL.commit()

In [4]:
SQL_query = executeSQL.execute("select * from student_score")

In [5]:
#fetch result from the sqlite database
resultset = SQL_query.fetchall()

In [6]:
insertSQL = [(10, "Kai", 99.5, 98.9), 
             (12, "John", 44.6, 79.7),
             (6, "daisy", 98.5, 32.4),
             (11, "Dave", 56.1, 67.3),
             (2, "Maisey", 56.2, 12.3)
            ]

In [7]:
insert_statement = "insert into student_score values (?, ?, ?, ?)"
executeSQL.executemany(insert_statement, insertSQL)
executeSQL.commit()

In [8]:
SQL_query = executeSQL.execute("select * from student_score")

In [9]:
resultset = SQL_query.fetchall()
resultset

[(10, 'Kai', 99.5, 98.9),
 (12, 'John', 44.6, 79.7),
 (6, 'daisy', 98.5, 32.4),
 (11, 'Dave', 56.1, 67.3),
 (2, 'Maisey', 56.2, 12.3)]

In [17]:
# Storing the sql query result in the form of a dataframe
df_student_records = pd.DataFrame(resultset, columns = ["ID", "NAME", "Math", "Science"])
df_student_records

   ID    NAME  Math  Science
0  10     Kai  99.5     98.9
1  12    John  44.6     79.7
2   6   daisy  98.5     32.4
3  11    Dave  56.1     67.3
4   2  Maisey  56.2     12.3